import React from 'react';
import NavBar from "../../Navber/NavBar";
import './About.css';
import schoolPhoto from '../../assets/slider/1637769815_sld1.jpg';

const AboutUs = () => {
    return (
        <div className='relative z-50'>
            <NavBar />
            <div className="about-container">
                <div className="content-wrapper">
                    <img src={schoolPhoto} alt="School" className="school-photo" />
                    <h1 className="main-title text-center">ক্যাম্পাস পরিচিতি</h1>
                    <p className="description">
                        ১৯৪৯ সালে চৌধুরী গওহরুজ্জামান নামে এক সরকারি কর্মকতার হাত ধরে প্রতিষ্ঠিত হয় রৌমারী সিজি জামান হাই স্কুল। রৌমারী উপজেলার পশ্চিম পার্শ্বে আধুনিক স্থাপত্যশৈলীর অনুপম কারুকার্য খচিত রৌমারী সি.জি. জামান সরকারি উচ্চ বিদ্যালয়ের সুবিশাল ক্যাম্পাস অবস্থিত। ক্যাম্পাসটিতে রয়েছে ৪টি আলাদা একাডেমিক ভবন, নান্দনিক প্রশাসনিক ভবন, প্রশস্ত লাইব্রেরি, মাঠ, আধুনিক প্রযুক্তি সমৃদ্ধ মাল্টিমিডিয়া ক্লাসরুম, সর্বাধুনিক আইসিটি ল্যাব, মানসম্মত বিজ্ঞানাগার, কমন রুম, নামাজ ঘর ও ক্যান্টিন। সম্পূর্ণ ক্যাম্পাসটি সার্বক্ষণিক সিসি ক্যামেরা দ্বারা নিয়ন্ত্রিত। এই ক্যাম্পাসে রয়েছে একটি মুক্ত মঞ্চ। বিদ্যালয়টির পাশেই রয়েছে একটি প্রাথমিক বিদ্যালয়। বিশাল খেলার মাঠ। রয়েছে একটি সুবিশাল পুকুর। বিদ্যালয়টির পাশেই রয়েছে রৌমারীর উপজেলার কেন্দ্রীয় শহীদ মিনার।
                    </p>

                    <div className="features-section">
                        <h2 className="section-title text-center">প্রতিষ্ঠানের অনন্য বৈশিষ্ট্য</h2>
                        <ul className="features-list">
                            <li>সৃজনশীল পদ্ধতির উপর প্রশিক্ষিত, দক্ষ ও নিষ্ঠাবান শিক্ষক দ্বারা যুগোপযোগী পাঠদান।</li>
                            <li>সর্বাধিক ক্লাস ও নিয়মিত পরীক্ষা গ্রহণ।</li>
                            <li>প্রতিদিন ভিজিলেন্স টিম কর্তৃক ছাত্র-ছাত্রীদের পোশাক, আইডি কার্ড ব্যবহারসহ অভ্যন্তরীণ নিয়ম-শৃঙ্খলা নিশ্চিতকরণ।</li>
                            <li>শিক্ষার্থীদের নিজ নিজ ধর্ম পালনে উৎসাহিত করা।</li>
                            <li>ক্রীয়া শিক্ষক দ্বারা শিক্ষার্থীদের শরীরচর্চা, খেলাধুলা ও বিনোদনের ব্যবস্থা।</li>
                            <li>পড়ালেখার পাশাপাশি সাহিত্য ও সংস্কৃতি চর্চা এবং দর্শনীয় স্থানে শিক্ষার্থীদের নিয়ে শিক্ষা সফরের ব্যবস্থা।</li>
                            <li>বিভিন্ন জাতীয় দিবস ও অনুষ্ঠানে অংশগ্রহণ নিশ্চিত করা।</li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default AboutUs;
